my_notes.md


<a id="org3346bca"></a>

## Language Features

-   [ ] Clarify \`()\` as logic clauses and Type Groupings
-   [ ] Rewrite any code to prefer A? types as Unions (A | Nil)
    -   [ ] Emit warnings/errors for unhandled Nil cases in functions
-   [X] ‼️ Better Type delimiters in WS mode
    -   Any complex grouped types, Function, Pi, Sigma use \`()\`
        -   [X] 👩‍🔬🦆 Syntax Workshop!
            -   We repurpose \`<&#x2026;>\` to unify Pi and Sigma dependent types
-   [ ] ‼️🦆 Workshop Session Syntax
    -   [ ] Syntax Notes
-   [ ] ~~Anonymous Relation \`?()\`&#x2026; but also \`rel\`~~ DEFER
    
    | Command Language | Relational Languages |              |
    | []  OR  "bare"   | ()                   |              |
    | defn             | defr                 |              |
    | fn               | rel                  |              |
    | #[]              | ?()                  | ;; more ⚙️🔧🧠 |
    
    -   [ ] Syntax Notes
-   [X] ~~Deprecate \`<>\` (but keep, for now)~~
    -   [X] Repurpose \`<>\` For Pi and Sigma Types
-   [X] Multi-arity defn: Case-split syntax with multiple arities (original feature request)
-   [X] Partial function application with wildcards
-   [ ] 📝 variable argument support \`&#x2026;name\` syntax?
-   [ ] List head tail syntax '[x1 x2 \_ | xs]
-   [X] Migrate Groupings syntax from \`()\` to \`[]\`
-   [X] define sigil syntax for common data structures (see Syntax Studies below)
-   [X] Prologos \`defmacro\`
    -   test (see re: homoiconicity concerns)
-   [X] Unit Type
    -   Unit is vacuously true ≅ Nil
-   [X] Nil Type? (equivalent semantically to Unit.. redundant? or good meaning?)
    -   [X] verify
-   [X] Union Type
-   [X] Nullable Type? -> Union Type of [A | Nil]
-   [X] Memoization Infra
-   [-] Polymorphic Dispatch 🦆
    -   [X] \`trait\` and \`impl\`
    -   [ ] ??? check back on notes for further design patterns
-   With Map key access, what does it mean for a collection to be an operator in the first position?
    -   m.key
    -   also with Vec[indx] syntax?
-   [ ] [BUNDLES!!!](#bundles)

-   [X] Return types arity style \`A B C -> D\` **NOT** curry style: \`A -> B -> C -> D\`
-   [X] \`defn\` default public \`defn-\` default private &#x2013; deprecate \`provide\`
-   [X] \`require\` QoL - \`:as\`
-   [X] \`let\` block vs in-line \`let\`s
    -   We support both&#x2026; sibling in-line lets share same local scope
    -   Design research/🦆
-   [ ] Map with key access syntax
    -   Make Example in Syntax Lab
    -   Implicit Map syntax
-   [X] foreign/ffi syntax
-   Metadata with ^{&#x2026;} ???
-   [X] ensure foreign symbols import cleanly
    -   [X] add :as foreign symbol aliasing
    -   [X] add WS support for foreign symbol imports
    -   [X] foreign symbols use \`/\` as distinct from prologos \`::\`
-   add a javascript foreign import
    -   spin up a v8 vm when there's a js import/block, run against that as sibling runtime


<a id="org4c4336f"></a>

## optmiizations

-   [ ] loop fusion with |> >>
    -   [ ] fusion only on pipe with reduce termination, needs further optimization
-   [ ] Type inference audit
    -   we know there's places for improvement


<a id="orgd780735"></a>

## Array Language!

-   <f g h> Point Free combinators, Combinator Logic
    -   Intended to work over collections&#x2013;arrays, in particular


<a id="orgfe29006"></a>

## todo

-   [ ] Higher-rank polymorphism syntax in def/defn

```prologos
;;    Higher-rank polymorphism works with `(def ... : [type] body)`. The key insight: **`spec`/`defn` cannot handle higher-rank types** (Pi as parameter), but **`(def name : [type] body)` can be freely mixed into WS files**. And the transducer functions need higher-rank types for the `xf` parameter.

;;  Now I understand the constraints. For the transducer rewrite:
;;  - Functions with simple types (like `list-conj`) → use `spec`/`defn` (pure WS)
;;  - Functions with higher-rank polymorphic params (like `transduce`, `xf-compose`) → must use `(def ... : ...)` with sexp bodies
;;  - For the `(def ...)` forms, the TYPE annotation should use `[...]` bracket syntax, and the body uses sexp with uncurried arguments where possible

  (def map-xf : [Pi [A :0 <Type>] [Pi [B :0 <Type>]
                  [-> [-> A B]
                    [Pi [R :0 <Type>] [-> [-> R [-> B R]] [-> R [-> A R]]]]]]]
    (fn (A :0 (Type 0)) (fn (B :0 (Type 0)) (fn (f : (-> A B))
      (fn (R :0 (Type 0)) (fn (rf : (-> R (-> B R))) (fn (acc : R) (fn (x : A)
        (rf acc (f x))))))))))


```


<a id="orgd739740"></a>

## Namespacing

-   [X] auto provide \`defn\`s
    -   [X] create private defn- and co.
    -   [X] remove/deprecate \`provide\`
-   [X] Ensure namespace aliasing with \`:as\`
-   [X] change namespace delimiter from \`/\` to \`::\`
-   [ ] determine what core libraries get loaded in automatically can be called in by their fully-qualified names without require


<a id="org8afeb84"></a>

## Research/Implementation Guidance Documentations

-   [ ] Updated Deep Propagator Implementation Guide?
    -   Update with choice-point designs
    -   What are the core
-   [ ] WAM-light? SLD/SLG fallbacks
    -   What's the MVP for Unification, at least? (Our type inference already has this&#x2026; can we re-purpose the same tooling?)
-   [ ] Dependent Type Interactive Design: Agda/Idris: Implementation Guide
-   [ ] Develop Spec Language as core to Dependent Type Interactive Dev
    -   Lessons from Clojure | Idris | Agda
    -   Property Based test (comprehensive research across language ecosystem)
        -   properl - Erlang
        -   Lean, Coq, Maude&#x2026; Formal methods as a grounding into sound inference
    -   Automated fuzzing/generative testing at a push of button
    -   [ ] Derive Properties (see notes&#x2026; fill in more here)
-   [ ] Best in Modern Tooling Support
    -   Package manager
    -   build tools
    -   test framework
-   [ ] Modal Logic | LTL Applications&#x2026; How does our type system do at expressing, constructing Modal Logic Modelling!!!!
-   Point Free, Combinators, Combinator Logic, and the History and Frontiers of Array Programming!!


<a id="bundles"></a>

# Bundles

```prologos
bundle CompoundTypeConstraint := (Eq Ord MyOtherTrait)

;; ========================================
;; We have:
;; ========================================

trait Eq (A : Type)
  (==) : A -> A -> Bool

trait Ord (A : Type)
  compare : A -> A -> Ordering

;; Independent predicates, combined as needed

;; If a function needs both:
defn foo [x : A] where (Eq A, Ord A)
  ...

;; Or use a bundle:
bundle Comparable (A) = (Eq A, Ord A)

defn foo [x : A] where (Comparable A)
  ...

```

Supertraits and trait inheritance is inherently IMPLICATION bundles are Conjunctive constraints, scaling Type refinement like prolog conjunctive clauses, One bundle can be used as a sub-constraint in another. COMPOSES!!

```quote
| Aspect              | Traditional (Supertraits) | Prologos (Bundles)    |
|---------------------+---------------------------+-----------------------|
| Structure           | Tree (hierarchy)          | Set (flat)            |
| Combination         | Inheritance (→)           | Conjunction (∧)       |
| Flexibility         | Rigid paths               | Any combination       |
| Adding constraints  | Modify hierarchy          | Define new bundle     |
| Prolog mapping      | Implication (unnatural)   | Conjunction (natural) |
| Lattice structure   | Partial order             | Join-semilattice      |
| Propagator friendly | Awkward                   | Natural               |
```

-   What Makes Bundles Different
