my_notes.org
** 1. Composition, Not Inheritance

#+begin_src prologos
;; ========================================
;; Supertraits (inheritance): Implication
;; ========================================

trait Ord : Eq          ;; Ord → Eq
trait Hash : Eq         ;; Hash → Eq
trait Num : Add, Mul    ;; Num → Add ∧ Mul

;; Problem: rigid hierarchy
;; Num MUST include Add and Mul
;; Can't have Num without them

;; ========================================
;; Bundles (composition): Conjunction
;; ========================================

bundle Numeric = (Add, Mul, Neg, Eq)
bundle Comparable = (Eq, Ord)
bundle Hashable = (Eq, Hash)

;; Flexible: Define new bundles freely
bundle MySpecial = (Add, Hash, Seqable)

;; No hierarchy, just sets of requirements
#+end_src

** 2. Arbitrary Refinement

#+begin_src prologos
;; Start broad
bundle Basic = (Eq)

;; Refine progressively
bundle Ordered = (Basic, Ord)          ;; = (Eq, Ord)
bundle Complete = (Ordered, Hash)       ;; = (Eq, Ord, Hash)
bundle Full = (Complete, Show, Parse)   ;; = (Eq, Ord, Hash, Show, Parse)

;; Or lateral combinations
bundle PrintableOrdered = (Ord, Show)
bundle SerializableHashable = (Hash, Serialize)

;; Any combination you need!
#+end_src

** 3. Open-World Assumption

#+begin_src prologos
;; New traits can be added later
trait MyNewTrait

;; New bundles can combine old and new
bundle Enhanced = (Eq, Ord, MyNewTrait)

;; No need to modify existing traits
;; No reopening of trait hierarchies
;; Just define new bundles as needed
#+end_src

---


** The Lattice Structure

Bundles form a /lattice/ under subset ordering:

#+begin_src
                     ┌─────────────────────────┐
                     │ (Eq, Ord, Hash, Show)   │  ← most refined
                     └───────────┬─────────────┘
                                 │
           ┌─────────────────────┼─────────────────────┐
           ▼                     ▼                     ▼
   ┌───────────────┐    ┌───────────────┐    ┌───────────────┐
   │ (Eq, Ord, Hash)│   │ (Eq, Ord, Show)│   │(Eq, Hash, Show)│
   └───────┬───────┘    └───────┬───────┘    └───────┬───────┘
           │                    │                    │
     ┌─────┴─────┐        ┌─────┴─────┐        ┌─────┴─────┐
     ▼           ▼        ▼           ▼        ▼           ▼
┌─────────┐ ┌─────────┐ ┌─────────┐ ...
│ (Eq,Ord)│ │(Eq,Hash)│ │(Eq,Show)│
└────┬────┘ └────┬────┘ └────┬────┘
     │           │           │
     └───────────┼───────────┘
                 ▼
            ┌─────────┐
            │  (Eq)   │  ← least refined
            └─────────┘
#+end_src

This is a /join-semilattice/:
- Meet (∧) = union of constraints = more refined
- Join (∨) = intersection of constraints = less refined


Let's stage all relevant changes; then write a clean commit message output as a markdown block. ONLY STAGE, DO NOT COMMIT.


* Syntax Studies
** Multi-arity function bodies
#+begin_src prologos
;; Multi-arity syntax design
;; Option 1: groupings with `()`
defn clamp
  "clamp `low` `high` returns a function that clamps `x` to [`low`, `high`]"
  ([low : Nat, high : Nat] : Nat -> Nat
    fn [x] max low (min x high))

  ([x : Nat, low : Nat, high : Nat] : Nat
    max low (min x high))

;; Option 2: Case-Style
defn clamp
  "Clamp a value to a range"
  | [low : Nat, high : Nat] : Nat -> Nat
      fn [x] (max low (min x high))

  | [x : Nat, low : Nat, high : Nat] -> Nat
      max low (min x high)
#+end_src
** IDEAs FOR PAREN GROUPINGS
#+begin_src prologos

  ;; if we move from `()` -> `[]` groupings for AST-nesting
  ;; perhaps we could set aside `()` to offer a mixed fix arithmetic sub-language???
  ;; NOPE!

  [(x : A) -> B]
  <(x : A) -> B>

  [(x : A) * B]
  <(x : A) * B>


#+end_src



Next we want to consider design and implementation for Phace 2c: Seq Fusion / Transducer. We are seeking to ensure that anytime the compiler sees our pipe syntax `|>` that it automatically does a "loop fusion" or transducer over the entire structure.

We have two specific syntax operators that we would like to introduce in this work `|>` and `>>`

The `>>` or transducer-pipe operator takes a list of forms that each return a point-free transducer
#+begin_src prologos
def xf
  >> map inc
     filter even?
     map [* _ _]    ;; same argument goes in hole


#+end_src





** Mixed syntax
#+begin_src prologos
spec find-path Graph Node Node -> Maybe [List Node]
defn find-path [graph, start, end]
  ;; Define a local relation
  let reachable := (rel [?from ?to ?path]
    &> (= ?from ?to)
       (= ?path '[?to | nil])
    &> (edge ?from ?mid)
       (reachable ?mid ?to ?rest)
       (= ?path '[?from | ?rest])

  ;; Use relation in functional context
  match (solve [reachable start end ?p])
    | [some path] -> [just path]
    | none        -> nothing

#+end_src




** call site typing, "Explicit Application"

- When Might You Want Explicit Type Arguments?

Sometimes inference fails or you want to be explicit:
#+begin_src prologos
  ;; Or at call site (if we support it)
  let xs = nil @Nat  ;; "nil at type Nat"
#+end_src



** Piping

#+begin_src prologos

  |>    `pipe-as`
  |>.   `pipe-first`
  |>..  `pipe-last`

  >>  Transducer

#+end_src

** `spec`

#+begin_src prologos
spec add Nat Nat -> Nat
defn add [x y]
    + x y


defn clamp
  "Clamp a value to a range"
  | [low : Nat, high : Nat] : Nat -> Nat
      fn [x] (max low (min x high))

  | [x : Nat, low : Nat, high : Nat] -> Nat
      max low (min x high)
;; ---

spec clamp
  "Clamp a value to a range"
  | Nat Nat -> [Nat -> Nat]
  | Nat Nat Nat -> Nat

defn clamp
  | [low high] [fn [x] (max low (min x high))]
  | [max low [min x high]]

;; full potential example
;; This starts to feel like Clojure's =spec= system—contracts, generative testing, documentation all in one.
spec add
  "Add two natural numbers."
  Nat Nat -> Nat
  :examples
    [add 1 2] => 3
    [add 0 n] => n
  :properties
    [add x y] = [add y x]   ;; commutativity

#+end_src

** Schema, Selection, Session
*** schema
*** selection: require, include, and provide
*** session




** Point Free... APL Style Trains, Trines, and Trouble????

#+begin_src prologos

spec compose [B -> C] [A -> B] -> [A -> C]
defn compose [f g]
  f [g _]

#+end_src







** Free standing hash-map: The Implicit HashMap Syntax
  * Keys on same level implicit Hashmap
  * 

#+begin_src prologos

spec add
  "Add two natural numbers."
  Nat Nat -> Nat
  :examples
    [add 1 2] => 3
    [add 0 n] => n
  :properties
    [add x y] = [add y x]   ;; commutativity

#+end_src





** In-line let
  * `:=` vs `let`

#+begin_src prologos

  :=  foo 42
  let foo 42


  let x : Nat 42     ;; 1?
  let x : Nat = 42   ;; 2?
  let x : Nat := 42  ;; 3?

  ;; should the `:=` or `=` be optional?



  ;; 1. Paren Groupings? `()`
  let answer <Nat> (mult 21 2)  ;; 1?  var <Type> expr
  let answer : Nat (mult 21 2)  ;; 2?  var : Type expr
  let answer::Nat  (mult 21 2)  ;; 3?  var::Type  expr

  ;; 2. Square brackets groupings? `[]`
  let answer <Nat> [mult 21 2]  ;; 1?   var <Type> expr
  let answer : Nat [mult 21 2]  ;; 2?   var : Type expr
  let answer::Nat  [mult 21 2]  ;; 3?   var::Type expr




  let xs [: Vec 5 Nat]  [1 2 3 4 5]

  let xs : Vec 5 Nat := [1 2 3 4 5]
  let ys : List Nat  := #[3 4 5]
  let xs : List Nat  := #[1 2 | ys]
  let xs : Seq A := #'[...]  ;; VERY LOW CONFIDENCE ON THIS SYNTAX
  let xs : Set A := #{...}   ;; EDN-style sets
  let xs : HMapType := {:k v, ...}  ;; EDN-style maps


  let [xs [: List Nat] #[10 20]
       ys [: List Nat] #[3 4 5]
       zs #[xs | ys]]

  let [xs (: List Nat) #[10 20]
       ys (: List Nat) #[3 4 5]
       zs #[xs | ys]]


   map [add 2 _] xs
   map [clamp _ 50 100] xs

   map (add 2 _) xs
   map (clamp _ 50 100) xs


#+end_src

