my_notes.md


<a id="orge8dbb25"></a>

## 1. Composition, Not Inheritance

```prologos
;; ========================================
;; Supertraits (inheritance): Implication
;; ========================================

trait Ord : Eq          ;; Ord → Eq
trait Hash : Eq         ;; Hash → Eq
trait Num : Add, Mul    ;; Num → Add ∧ Mul

;; Problem: rigid hierarchy
;; Num MUST include Add and Mul
;; Can't have Num without them

;; ========================================
;; Bundles (composition): Conjunction
;; ========================================

bundle Numeric = (Add, Mul, Neg, Eq)
bundle Comparable = (Eq, Ord)
bundle Hashable = (Eq, Hash)

;; Flexible: Define new bundles freely
bundle MySpecial = (Add, Hash, Seqable)

;; No hierarchy, just sets of requirements
```


<a id="orgc6e0c90"></a>

## 2. Arbitrary Refinement

```prologos
;; Start broad
bundle Basic = (Eq)

;; Refine progressively
bundle Ordered = (Basic, Ord)          ;; = (Eq, Ord)
bundle Complete = (Ordered, Hash)       ;; = (Eq, Ord, Hash)
bundle Full = (Complete, Show, Parse)   ;; = (Eq, Ord, Hash, Show, Parse)

;; Or lateral combinations
bundle PrintableOrdered = (Ord, Show)
bundle SerializableHashable = (Hash, Serialize)

;; Any combination you need!
```


<a id="orgee33601"></a>

## 3. Open-World Assumption

```prologos
;; New traits can be added later
trait MyNewTrait

;; New bundles can combine old and new
bundle Enhanced = (Eq, Ord, MyNewTrait)

;; No need to modify existing traits
;; No reopening of trait hierarchies
;; Just define new bundles as needed
```

&#x2014;


<a id="orge3feef6"></a>

## The Lattice Structure

Bundles form a *lattice* under subset ordering:

```
                     ┌─────────────────────────┐
                     │ (Eq, Ord, Hash, Show)   │  ← most refined
                     └───────────┬─────────────┘
                                 │
           ┌─────────────────────┼─────────────────────┐
           ▼                     ▼                     ▼
   ┌───────────────┐    ┌───────────────┐    ┌───────────────┐
   │ (Eq, Ord, Hash)│   │ (Eq, Ord, Show)│   │(Eq, Hash, Show)│
   └───────┬───────┘    └───────┬───────┘    └───────┬───────┘
           │                    │                    │
     ┌─────┴─────┐        ┌─────┴─────┐        ┌─────┴─────┐
     ▼           ▼        ▼           ▼        ▼           ▼
┌─────────┐ ┌─────────┐ ┌─────────┐ ...
│ (Eq,Ord)│ │(Eq,Hash)│ │(Eq,Show)│
└────┬────┘ └────┬────┘ └────┬────┘
     │           │           │
     └───────────┼───────────┘
                 ▼
            ┌─────────┐
            │  (Eq)   │  ← least refined
            └─────────┘
```

This is a *join-semilattice*:

-   Meet (∧) = union of constraints = more refined
-   Join (∨) = intersection of constraints = less refined

Let's stage all relevant changes; then write a clean commit message output as a markdown block. ONLY STAGE, DO NOT COMMIT.


<a id="org284eedf"></a>

# Syntax Studies


<a id="orgd51be3d"></a>

## Multi-arity function bodies

```prologos
;; Multi-arity syntax design
;; Option 1: groupings with `()`
defn clamp
  "clamp `low` `high` returns a function that clamps `x` to [`low`, `high`]"
  ([low : Nat, high : Nat] : Nat -> Nat
    fn [x] max low (min x high))

  ([x : Nat, low : Nat, high : Nat] : Nat
    max low (min x high))

;; Option 2: Case-Style
defn clamp
  "Clamp a value to a range"
  | [low : Nat, high : Nat] : Nat -> Nat
      fn [x] (max low (min x high))

  | [x : Nat, low : Nat, high : Nat] -> Nat
      max low (min x high)
```


<a id="orgb3d8dd0"></a>

## IDEAs FOR PAREN GROUPINGS

```prologos

;; if we move from `()` -> `[]` groupings for AST-nesting
;; perhaps we could set aside `()` to offer a mixed fix arithmetic sub-language???
;; NOPE!

[(x : A) -> B]
<(x : A) -> B>

[(x : A) * B]
<(x : A) * B>


```

Next we want to consider design and implementation for Phace 2c: Seq Fusion / Transducer. We are seeking to ensure that anytime the compiler sees our pipe syntax \`|>\` that it automatically does a "loop fusion" or transducer over the entire structure.

We have two specific syntax operators that we would like to introduce in this work \`|>\` and \`>>\`

The \`>>\` or transducer-pipe operator takes a list of forms that each return a point-free transducer

```prologos
def xf
  >> map inc
     filter even?
     map [* _ _]    ;; same argument goes in hole


```


<a id="org9b241b2"></a>

## Mixed syntax

```prologos
spec find-path Graph Node Node -> Maybe [List Node]
defn find-path [graph, start, end]
  ;; Define a local relation
  let reachable := (rel [?from ?to ?path]
    &> (= ?from ?to)
       (= ?path '[?to | nil])
    &> (edge ?from ?mid)
       (reachable ?mid ?to ?rest)
       (= ?path '[?from | ?rest])

  ;; Use relation in functional context
  match (solve [reachable start end ?p])
    | [some path] -> [just path]
    | none        -> nothing

```


<a id="org03e6dda"></a>

## call site typing, "Explicit Application"

-   When Might You Want Explicit Type Arguments?

Sometimes inference fails or you want to be explicit:

```prologos
;; Or at call site (if we support it)
let xs = nil @Nat  ;; "nil at type Nat"
```


<a id="org4d8ee5f"></a>

## Piping

```prologos

|>    `pipe-as`
|>.   `pipe-first`
|>..  `pipe-last`

>>  Transducer

```


<a id="org18e55d8"></a>

## \`spec\`

```prologos
spec add Nat Nat -> Nat
defn add [x y]
    + x y


defn clamp
  "Clamp a value to a range"
  | [low : Nat, high : Nat] : Nat -> Nat
      fn [x] (max low (min x high))

  | [x : Nat, low : Nat, high : Nat] -> Nat
      max low (min x high)
;; ---

spec clamp
  "Clamp a value to a range"
  | Nat Nat -> [Nat -> Nat]
  | Nat Nat Nat -> Nat

defn clamp
  | [low high] [fn [x] (max low (min x high))]
  | [max low [min x high]]

;; full potential example
;; This starts to feel like Clojure's =spec= system—contracts, generative testing, documentation all in one.
spec add
  "Add two natural numbers."
  Nat Nat -> Nat
  :examples
    [add 1 2] => 3
    [add 0 n] => n
  :properties
    [add x y] = [add y x]   ;; commutativity

```


<a id="org926fd20"></a>

## Schema, Selection, Session


<a id="org48b7dc5"></a>

### schema


<a id="org9b0f77d"></a>

### selection: require, include, and provide


<a id="org0b14778"></a>

### session


<a id="orgdb2a966"></a>

## Point Free&#x2026; APL Style Trains, Trines, and Trouble????

```prologos

spec compose [B -> C] [A -> B] -> [A -> C]
defn compose [f g]
  f [g _]

```


<a id="orgfaaeb6f"></a>

## Free standing hash-map: The Implicit HashMap Syntax

-   Keys on same level implicit Hashmap
-   

```prologos

spec add
  "Add two natural numbers."
  Nat Nat -> Nat
  :examples
    [add 1 2] => 3
    [add 0 n] => n
  :properties
    [add x y] = [add y x]   ;; commutativity

```


<a id="org94b12b8"></a>

## In-line let

-   \`:=\` vs \`let\`

```prologos

:=  foo 42
let foo 42


let x : Nat 42     ;; 1?
let x : Nat = 42   ;; 2?
let x : Nat := 42  ;; 3?

;; should the `:=` or `=` be optional?



;; 1. Paren Groupings? `()`
let answer <Nat> (mult 21 2)  ;; 1?  var <Type> expr
let answer : Nat (mult 21 2)  ;; 2?  var : Type expr
let answer::Nat  (mult 21 2)  ;; 3?  var::Type  expr

;; 2. Square brackets groupings? `[]`
let answer <Nat> [mult 21 2]  ;; 1?   var <Type> expr
let answer : Nat [mult 21 2]  ;; 2?   var : Type expr
let answer::Nat  [mult 21 2]  ;; 3?   var::Type expr




let xs [: Vec 5 Nat]  [1 2 3 4 5]

let xs : Vec 5 Nat := [1 2 3 4 5]
let ys : List Nat  := #[3 4 5]
let xs : List Nat  := #[1 2 | ys]
let xs : Seq A := #'[...]  ;; VERY LOW CONFIDENCE ON THIS SYNTAX
let xs : Set A := #{...}   ;; EDN-style sets
let xs : HMapType := {:k v, ...}  ;; EDN-style maps


let [xs [: List Nat] #[10 20]
     ys [: List Nat] #[3 4 5]
     zs #[xs | ys]]

let [xs (: List Nat) #[10 20]
     ys (: List Nat) #[3 4 5]
     zs #[xs | ys]]


 map [add 2 _] xs
 map [clamp _ 50 100] xs

 map (add 2 _) xs
 map (clamp _ 50 100) xs


```
