my_notes.org
** Sigil Design
#+begin_src quote
| Collection        | Sigil    | Mnemonic              | Example          |
|-------------------+----------+-----------------------+------------------|
| Grouping          |  `[...]`  | "Expression"         | =[add 1 2]=      |
| Persistent Vec    | `@[...]` | "At" = indexed access | =@[1 2 3]=       |
| Linked List       | `'[...]` | "Quote" = literal     | ='[1 2 3]=       |
| Lazy Seq          | `~[...]` | "Tilde" = lazy/wave   | =~[1 2 3]=       |
| Set               | `#{...}` | EDN-style             | =#{1 2 3}=       |
| Map               |  `{...}` | EDN-style            | ={:a 1 :b 2}=     |
| Tuple (if needed) | =(...)=  | Traditional           | =(1, "a", true)= |
#+end_src



** fn

#+begin_src prologos

  fn [x] add 2 x

#+end_src





** HashMap
*** Map Literal uses EDN style
#+begin_src prologos
  {:name "Alice" :age 42}
#+end_src
*** Lookup Syntax

** foreign imports and ffi






** Partial Functions, strict arity, and the Hole-y Trinity: Curry Favor

*** Use placeholders to invoke partial function
#+begin_src prologos
defn clamp
  "Clamp value to range"
  | [low : Nat, high : Nat] : Nat -> Nat
      fn x (max low (min high x))
  | [low : Nat, high : Nat, x : Nat] : Nat
      max low (min high x)

;; Now both work:
clamp 0 100          ;; 2-arity, returns function
clamp 0 100 50       ;; 3-arity, returns value

;; And placeholder works too:
map (clamp 0 100 _) xs   ;; explicit partial of 3-arity
map (clamp 0 100) xs     ;; using 2-arity overload (cleaner!)

#+end_src


** Type Syntax
  * <Type>
  * var : Type
  * var::Type

** Logical Language
*** Keywords
#+begin_src prologos
  rel  | relation
  defr | defrel
  clause
  &>
  =   ;; unify
  .>

#+end_src

*** Logic Variable Syntax and notes

| General Modality | ?var        | Input OR Output |
| Input   Modality | var OR -var | Input only      |
| Output  Modality | ?+var       | Output          |


#+begin_src prologos



#+end_src



  * *What is a good convention for naming `defr` forms? (Like predicate functions in Clojure, by convention, end in `?`)
    - We don't want to enforce the naming, but encourage community


*** Namespaces and Requires

  * `require` should take a list of require forms and allow for local aliasing with `alias/def-name` syntax

Example:
#+begin_src prologos

  require [prologos.data.nat  :as nat  :refer [add mult pow zero?]]
          [prologos.data.bool :as bool :refer [not and or]]
          [prologos.data.list :as list :refer [List nil cons map filter reduce]]

  defn double-all [xs : List Nat] : List Nat
    map (nat/double _) xs

#+end_src




*** Clause Pipes
**** `&>`
#+begin_src prologos

#+end_src

*** Unification

#+begin_src prologos
  ~
  <=>
  =   ;; semantically overloaded... but greater primacy to Logical Language Aspect ***


  ;; `:=` to functional binding
  ;; `==` to equality test

#+end_src



** fn/rel fusion...
** Unify | = | eq? 🤷‍♀️
  * Should we keep Prolog's use of `=` for unification
    - +use `unify` keyword?+
    - We're going with the classic `=` is unify! 🎉




* Data Structures
  * Relaxed Radix Balanced Trees (RRB-trees) compared with HAMT-vectors?


* Vision, Principles,
  * Interactive Development
    - The programmer is in constant conversation with the runtime tooling, code, evaluation
    - Hole-driven Development with Dependent Types
      - Derive structure, case splits, etc.
      - Editor Assisted Coding
    - In-line evaluation
    - Keep locked in to context (no switching cost between code and run/eval)
    - Frictionless Developer Tooling Integration
  * Tooling
    - Data Viewer
    - Build Tooling
    - Testing Infrastructure
    - Package Manager
  * Homoiconicity: Code is Data
    - What you you see is what you get, your code is your data
      - easy macro rewriting and expanding/inspectability of data and runtime
    - Uniform Syntax


* Considerations
** Part 2: Persistent Data Structures
*** 1. HAMT (Hash Array Mapped Trie)

#+begin_src
;; Key insight: 32-bit hash → 6 levels max (32^6 > 1 billion)
;; Each node: up to 32 children
;; Structural sharing: updates copy only path from root to changed leaf

       [root]
      /      \
   [node]   [node]
   /    \
[leaf] [leaf]  <-- update here copies 3 nodes, shares rest
#+end_src

*** 2. Transients for Batch Updates

#+begin_src prologos
;; Problem: building a map one item at a time = O(n log n)
;; Solution: transient (mutable) version for batch ops

defn build-map [pairs : List (Pair K V)] : Map K V
  persistent!
    (reduce pairs (transient empty-map)
      (fn acc (k, v) -> assoc! acc k v))
#+end_src

/3. RRB-Trees for Vectors/

If you want efficient =concat=, =slice=, =insert-at=, consider RRB-trees (Relaxed Radix Balanced) instead of plain tries.

#+begin_src prologos
;; Standard vector trie: O(n) concat
;; RRB-tree: O(log n) concat, slice, insert
#+end_src

*** 3. RRB-Trees for Vectors

If you want efficient =concat=, =slice=, =insert-at=, consider RRB-trees (Relaxed Radix Balanced) instead of plain tries.

#+begin_src prologos
;; Standard vector trie: O(n) concat
;; RRB-tree: O(log n) concat, slice, insert
#+end_src

*** 4. Structural Sharing + Logic Variables/
This is unique to Prologos:

#+begin_src prologos
;; Logic variables in persistent structures
:= m (map-of "a" ?x "b" ?y)

;; Unification might bind ?x
(unify ?x 42)

;; What happens to m?
;; Option A: m is unchanged (logic vars are immutable references)
;; Option B: m "sees" the binding (requires indirection)
#+end_src

You need to decide how logic variables interact with persistent structures.
** Part 3: Evaluation Strategy

/Key Question: Strict or Lazy by Default?/

| Strategy                 | Pros                            | Cons                         |
|--------------------------+---------------------------------+------------------------------|
| Strict (Clojure, ML)     | Predictable, debuggable         | Can't do infinite structures |
| Lazy (Haskell)           | Infinite structures, modularity | Space leaks, hard to reason  |
| Lazy Seqs Only (Clojure) | Best of both                    | Two mental models            |

- Recommendation for Prologos

#+begin_src prologos
;; Strict by default (like Clojure)
;; Explicit laziness via Seq and delay/force

defn eager-map {A B} [f : A -> B, xs : List A] : List B
  match xs
    | nil       -> nil
    | cons x xs -> cons (f x) (eager-map f xs)

defn lazy-map {A B} [f : A -> B, xs : Seq A] : Seq B
  match xs
    | empty    -> empty
    | cell x xs -> cell (f x) (delay (lazy-map f (force xs)))
#+end_src


* Higher Rank Pi Type Syntax
