my_notes.md


<a id="org2872ff0"></a>

## Sigil Design

```quote
| Collection        | Sigil    | Mnemonic              | Example          |
|-------------------+----------+-----------------------+------------------|
| Grouping          |  `[...]`  | "Expression"         | =[add 1 2]=      |
| Persistent Vec    | `@[...]` | "At" = indexed access | =@[1 2 3]=       |
| Linked List       | `'[...]` | "Quote" = literal     | ='[1 2 3]=       |
| Lazy Seq          | `~[...]` | "Tilde" = lazy/wave   | =~[1 2 3]=       |
| Set               | `#{...}` | EDN-style             | =#{1 2 3}=       |
| Map               |  `{...}` | EDN-style            | ={:a 1 :b 2}=     |
| Tuple (if needed) | =(...)=  | Traditional           | =(1, "a", true)= |
```


<a id="orgc823c31"></a>

## fn

```prologos

fn [x] add 2 x

```


<a id="org547a536"></a>

## HashMap


<a id="org848428b"></a>

### Map Literal uses EDN style

```prologos
{:name "Alice" :age 42}
```


<a id="org90102b4"></a>

### Lookup Syntax


<a id="orgb967c08"></a>

## foreign imports and ffi


<a id="orge5e55b8"></a>

## Partial Functions, strict arity, and the Hole-y Trinity: Curry Favor


<a id="orgc78eaa9"></a>

### Use placeholders to invoke partial function

```prologos
defn clamp
  "Clamp value to range"
  | [low : Nat, high : Nat] : Nat -> Nat
      fn x (max low (min high x))
  | [low : Nat, high : Nat, x : Nat] : Nat
      max low (min high x)

;; Now both work:
clamp 0 100          ;; 2-arity, returns function
clamp 0 100 50       ;; 3-arity, returns value

;; And placeholder works too:
map (clamp 0 100 _) xs   ;; explicit partial of 3-arity
map (clamp 0 100) xs     ;; using 2-arity overload (cleaner!)

```


<a id="org3424d1a"></a>

## Type Syntax

-   <Type>
-   var : Type
-   var::Type


<a id="org9895f38"></a>

## Logical Language


<a id="org85cce19"></a>

### Keywords

```prologos
rel  | relation
defr | defrel
clause
&>
=   ;; unify
.>

```


<a id="org619ec04"></a>

### Logic Variable Syntax and notes

| General Modality | ?var        | Input OR Output |
| Input   Modality | var OR -var | Input only      |
| Output  Modality | ?+var       | Output          |

```prologos



```

-   \*What is a good convention for naming \`defr\` forms? (Like predicate functions in Clojure, by convention, end in \`?\`)
    -   We don't want to enforce the naming, but encourage community


<a id="org8cd08a1"></a>

### Namespaces and Requires

-   \`require\` should take a list of require forms and allow for local aliasing with \`alias/def-name\` syntax

Example:

```prologos

require [prologos.data.nat  :as nat  :refer [add mult pow zero?]]
        [prologos.data.bool :as bool :refer [not and or]]
        [prologos.data.list :as list :refer [List nil cons map filter reduce]]

defn double-all [xs : List Nat] : List Nat
  map (nat/double _) xs

```


<a id="org0726d54"></a>

### Clause Pipes

1.  \`&>\`

    ```prologos
    
    ```


<a id="orge56258f"></a>

### Unification

```prologos
~
<=>
=   ;; semantically overloaded... but greater primacy to Logical Language Aspect ***


;; `:=` to functional binding
;; `==` to equality test

```


<a id="org5899a19"></a>

## fn/rel fusion&#x2026;


<a id="org96333f7"></a>

## Unify | = | eq? 🤷‍♀️

-   Should we keep Prolog's use of \`=\` for unification
    -   ~~use \`unify\` keyword?~~
    -   We're going with the classic \`=\` is unify! 🎉


<a id="org7ec5027"></a>

# Data Structures

-   Relaxed Radix Balanced Trees (RRB-trees) compared with HAMT-vectors?


<a id="org536203e"></a>

# Vision, Principles,

-   Interactive Development
    -   The programmer is in constant conversation with the runtime tooling, code, evaluation
    -   Hole-driven Development with Dependent Types
        -   Derive structure, case splits, etc.
        -   Editor Assisted Coding
    -   In-line evaluation
    -   Keep locked in to context (no switching cost between code and run/eval)
    -   Frictionless Developer Tooling Integration
-   Tooling
    -   Data Viewer
    -   Build Tooling
    -   Testing Infrastructure
    -   Package Manager
-   Homoiconicity: Code is Data
    -   What you you see is what you get, your code is your data
        -   easy macro rewriting and expanding/inspectability of data and runtime
    -   Uniform Syntax


<a id="org6652123"></a>

# Considerations


<a id="org8101f1f"></a>

## Part 2: Persistent Data Structures


<a id="orga5471c3"></a>

### 1. HAMT (Hash Array Mapped Trie)

```
;; Key insight: 32-bit hash → 6 levels max (32^6 > 1 billion)
;; Each node: up to 32 children
;; Structural sharing: updates copy only path from root to changed leaf

       [root]
      /      \
   [node]   [node]
   /    \
[leaf] [leaf]  <-- update here copies 3 nodes, shares rest
```


<a id="org8532c4b"></a>

### 2. Transients for Batch Updates

```prologos
;; Problem: building a map one item at a time = O(n log n)
;; Solution: transient (mutable) version for batch ops

defn build-map [pairs : List (Pair K V)] : Map K V
  persistent!
    (reduce pairs (transient empty-map)
      (fn acc (k, v) -> assoc! acc k v))
```

*3. RRB-Trees for Vectors*

If you want efficient `concat`, `slice`, `insert-at`, consider RRB-trees (Relaxed Radix Balanced) instead of plain tries.

```prologos
;; Standard vector trie: O(n) concat
;; RRB-tree: O(log n) concat, slice, insert
```


<a id="orgaded2a3"></a>

### 3. RRB-Trees for Vectors

If you want efficient `concat`, `slice`, `insert-at`, consider RRB-trees (Relaxed Radix Balanced) instead of plain tries.

```prologos
;; Standard vector trie: O(n) concat
;; RRB-tree: O(log n) concat, slice, insert
```


<a id="org66d36a4"></a>

### 4. Structural Sharing + Logic Variables/

This is unique to Prologos:

```prologos
;; Logic variables in persistent structures
:= m (map-of "a" ?x "b" ?y)

;; Unification might bind ?x
(unify ?x 42)

;; What happens to m?
;; Option A: m is unchanged (logic vars are immutable references)
;; Option B: m "sees" the binding (requires indirection)
```

You need to decide how logic variables interact with persistent structures.


<a id="orgd5ed640"></a>

## Part 3: Evaluation Strategy

*Key Question: Strict or Lazy by Default?*

| Strategy                 | Pros                            | Cons                         |
|------------------------ |------------------------------- |---------------------------- |
| Strict (Clojure, ML)     | Predictable, debuggable         | Can't do infinite structures |
| Lazy (Haskell)           | Infinite structures, modularity | Space leaks, hard to reason  |
| Lazy Seqs Only (Clojure) | Best of both                    | Two mental models            |

-   Recommendation for Prologos

```prologos
;; Strict by default (like Clojure)
;; Explicit laziness via Seq and delay/force

defn eager-map {A B} [f : A -> B, xs : List A] : List B
  match xs
    | nil       -> nil
    | cons x xs -> cons (f x) (eager-map f xs)

defn lazy-map {A B} [f : A -> B, xs : Seq A] : Seq B
  match xs
    | empty    -> empty
    | cell x xs -> cell (f x) (delay (lazy-map f (force xs)))
```


<a id="org975c3af"></a>

# Higher Rank Pi Type Syntax
