my_notes.org
** We have a current limitation with higher-rank Pi types that force us to use the s-expr backend language to write prologos transducers:
#+begin_src prologos
  (def xf-compose : [Pi [A :0 <Type>] [Pi [B :0 <Type>] [Pi [C :0 <Type>]
                    [-> [Pi [S :0 <Type>] [-> [-> S [-> B S]] [-> S [-> A S]]]]
                      [-> [Pi [S :0 <Type>] [-> [-> S [-> C S]] [-> S [-> B S]]]]
                        [Pi [S :0 <Type>] [-> [-> S [-> C S]] [-> S [-> A S]]]]]]]]]
  (fn (A :0 (Type 0)) (fn (B :0 (Type 0)) (fn (C :0 (Type 0))
    (fn (xf1 : (Pi (S :0 (Type 0)) (-> (-> S (-> B S)) (-> S (-> A S)))))
      (fn (xf2 : (Pi (S :0 (Type 0)) (-> (-> S (-> C S)) (-> S (-> B S)))))
        (fn (R :0 (Type 0)) (fn (rf : (-> R (-> C R)))
          (xf1 R (xf2 R rf))))))))))

#+end_src

With a proposal of adding implicit binders and <..> Pi in parameter position denoting a higher-rank polymorphic parameter, the rewrite would look something like:

#+begin_src prologos
  spec xf-compose {A B C : Type}
                <(S :0 Type) -> [S -> B -> S] -> S -> A -> S>
                <(S :0 Type) -> [S -> C -> S] -> S -> B -> S>
                -> <(S :0 Type) -> [S -> C -> S] -> S -> A -> S>
defn xf-compose [xf1 xf2]
  fn [R :0 <Type>] [rf]
    xf1 R [xf2 R rf]
#+end_src

The problem is, that I still cannot conceive of being able to write this. It feels clunky and unintuitive. Can we explore possible syntax design that would feel approachable to users yet able to express the requirements of higher rank pi types?

- Higher-Rank Types: Making Them Approachable

This is a fundamental challenge. Let me explore the design space.

---

- The Core Problem

Higher-rank types require /nested quantification/:

#+begin_src
;; Rank-1 (simple)
∀A. A → A                       ;; "for all A, A to A"

;; Rank-2 (higher)
(∀S. (S → B → S) → S → A → S)   ;; quantifier INSIDE argument
;; "a function that works for ANY S you give it"

;; This is what transducers need!
;; The reducer type (S → B → S) is polymorphic in S
;; The transducer doesn't know what S is
#+end_src

---

- Why It Feels Clunky

#+begin_src prologos
;; Current: explicit Pi everywhere
<(S :0 Type) -> [S -> B -> S] -> S -> A -> S>

;; Problems:
;; 1. S appears 4 times (noisy)
;; 2. :0 annotation (erased) adds visual weight
;; 3. The "shape" of a transducer is obscured
;; 4. Users must understand universal quantification
#+end_src

---

- Exploration: Multiple Syntax Approaches

---

- Approach A: Type Aliases Hide the Complexity

#+begin_src prologos
;; ========================================
;; Define the transducer type once
;; ========================================

type Reducer S A = S -> A -> S
type Transducer A B = forall S. Reducer S B -> Reducer S A

;; Now xf-compose is readable:
spec xf-compose {A B C : Type}
  Transducer A B -> Transducer B C -> Transducer A C

defn xf-compose [xf1 xf2]
  fn {S} [rf]
    xf1 (xf2 rf)
#+end_src

| Pros                        | Cons                           |
|-----------------------------+--------------------------------|
| ✅ Very clean at use site   | ⚠️ Must define type aliases   |
| ✅ Domain concepts named    | ⚠️ Hides the polymorphism     |
| ✅ Approachable to users    | ⚠️ Need =forall= in type alias |

---

- Approach B: Infer Higher-Rank from Usage

#+begin_src prologos
;; ========================================
;; Let compiler infer the polymorphism
;; ========================================

spec xf-compose {A B C}
  (Reducer _ B -> Reducer _ A) ->   ;; _ means "polymorphic here"
  (Reducer _ C -> Reducer _ B) ->
  (Reducer _ C -> Reducer _ A)

defn xf-compose [xf1 xf2]
  fn [rf]
    xf1 (xf2 rf)

;; Compiler sees _ in same position across arrows
;; Infers: this must be universally quantified
#+end_src

| Pros                        | Cons                            |
|-----------------------------+---------------------------------|
| ✅ Minimal syntax           | ⚠️ Inference may be undecidable |
| ✅ Familiar _ placeholder   | ⚠️ Magic / implicit             |
| ✅ Focus on structure       | ⚠️ Error messages harder        |

---

- Approach C: Explicit =forall= Keyword (Haskell-Style)

#+begin_src prologos
;; ========================================
;; Use forall keyword inline
;; ========================================

spec xf-compose {A B C}
  (forall S. [S -> B -> S] -> [S -> A -> S]) ->
  (forall S. [S -> C -> S] -> [S -> B -> S]) ->
  (forall S. [S -> C -> S] -> [S -> A -> S])

defn xf-compose [xf1 xf2]
  fn {S} [rf]
    xf1 {S} (xf2 {S} rf)
#+end_src

| Pros                        | Cons                         |
|-----------------------------+------------------------------|
| ✅ Explicit, clear          | ⚠️ Verbose                   |
| ✅ Familiar to Haskell users| ⚠️ "forall" is scary         |
| ✅ Standard in literature   | ⚠️ S repeated many times     |

---

- Approach D: =poly= Blocks for Scoped Quantification

#+begin_src prologos
;; ========================================
;; poly introduces a scoped type variable
;; ========================================

spec xf-compose {A B C}
  poly S. ([S B -> S] -> [S A -> S]) ->
  poly S. ([S C -> S] -> [S B -> S]) ->
  poly S. ([S C -> S] -> [S A -> S])

;; Or even shorter with convention:
;; poly always quantifies over immediately following type var

spec xf-compose {A B C}
  poly [S B -> S] -> [S A -> S] ->   ;; S is bound in this arg
  poly [S C -> S] -> [S B -> S] ->   ;; fresh S bound here
  poly [S C -> S] -> [S A -> S]      ;; fresh S bound here
#+end_src

| Pros                        | Cons                          |
|-----------------------------+-------------------------------|
| ✅ Scoped, clear binding    | ⚠️ New keyword                |
| ✅ Less scary than forall   | ⚠️ Still verbose              |

---

- Approach E: Arrow Annotations

#+begin_src prologos
;; ========================================
;; Annotate the arrow with polymorphism
;; ========================================

spec xf-compose {A B C}
  ([S B -> S] ->{S} [S A -> S]) ->    ;; ->{S} means "polymorphic in S"
  ([S C -> S] ->{S} [S B -> S]) ->
  ([S C -> S] ->{S} [S A -> S])

;; Or prefix:
spec xf-compose {A B C}
  {S}([S B -> S] -> [S A -> S]) ->    ;; {S} scopes over this arg
  {S}([S C -> S] -> [S B -> S]) ->
  {S}([S C -> S] -> [S A -> S])
#+end_src

| Pros                        | Cons                        |
|-----------------------------+-----------------------------|
| ✅ Compact                  | ⚠️ New annotation syntax    |
| ✅ Quantifier near binding  | ⚠️ May be cryptic           |

---

- Approach F: Pattern-Based / Relational View

Since you think in Prolog terms:

#+begin_src prologos
;; ========================================
;; Think of type as a relation/predicate
;; ========================================

;; "xf-compose takes two transducers and returns a transducer"
;; Transducer is a SHAPE, not a specific type

spec xf-compose {A B C}
  Xf A B -> Xf B C -> Xf A C

;; Xf A B is a "type pattern" that expands to:
;; "something that, for any S, transforms (S B -> S) to (S A -> S)"

;; Define the pattern:
pattern Xf A B = forall S. [S -> B -> S] -> [S -> A -> S]
#+end_src

| Pros                           | Cons                         |
|--------------------------------+------------------------------|
| ✅ Pattern = reusable shape    | ⚠️ New construct             |
| ✅ Matches Prolog intuition    | ⚠️ Pattern vs type confusion |
| ✅ Extremely clean at use site |                              |

---

- Approach G: Implicit Rank via Trait/Protocol

#+begin_src prologos
;; ========================================
;; Transducer as a trait, not a type
;; ========================================

trait Transducer (X : Type -> Type -> Type)
  transform : forall S. [S -> B -> S] -> [S -> A -> S]

;; Now functions just use the trait:
spec xf-compose {A B C}
  {X : Transducer A B} -> {Y : Transducer B C} -> Transducer A C

;; The higher-rank is hidden inside the trait definition
;; Users never see forall at the function level
#+end_src

| Pros                        | Cons                         |
|-----------------------------+------------------------------|
| ✅ Hides complexity         | ⚠️ Trait overhead            |
| ✅ Familiar pattern         | ⚠️ Indirection               |
| ✅ Extensible               | ⚠️ May be too abstract       |

---

- My Recommendation: Approach A + F (Aliases + Patterns)

#+begin_src prologos
;; ========================================
;; Step 1: Define the vocabulary
;; ========================================

;; Reducer: takes state and value, returns new state
type Reducer S A = S -> A -> S

;; Transducer: transforms reducers (polymorphic in state)
type Xf A B = forall S. Reducer S B -> Reducer S A

;; ========================================
;; Step 2: Use clean signatures
;; ========================================

spec xf-compose {A B C}
  Xf A B -> Xf B C -> Xf A C

spec map-xf {A B}
  (A -> B) -> Xf A B

spec filter-xf {A}
  (A -> Bool) -> Xf A A

spec take-xf {A}
  Nat -> Xf A A

;; ========================================
;; Step 3: Implementation uses {S} for type app
;; ========================================

defn xf-compose [xf1 xf2]
  fn {S} [rf : Reducer S C] : Reducer S A
    xf1 {S} (xf2 {S} rf)

;; Or let inference handle it:
defn xf-compose [xf1 xf2]
  fn [rf]
    xf1 (xf2 rf)

;; ========================================
;; Step 4: Users just use combinators
;; ========================================

def my-xf = >> (map-xf inc) (filter-xf even?) (take-xf 10)

;; They never see forall!
#+end_src

---

- The Key Insight

#+begin_src
USERS should see:          LIBRARY AUTHORS see:

Xf A B                     forall S. Reducer S B -> Reducer S A
Reducer S A                S -> A -> S
map-xf : (A -> B) -> Xf A B    (the full type)

Domain vocabulary          Type-theoretic machinery
#+end_src

The =forall= exists, but it's /hidden inside type aliases/.

---

- Surface Syntax Summary

#+begin_src prologos
;; ========================================
;; Type alias with forall
;; ========================================

type Xf A B = forall S. [S -> B -> S] -> [S -> A -> S]

;; ========================================
;; forall keyword when needed
;; ========================================

type Lens S A = forall F. Functor F => (A -> F A) -> S -> F S

;; ========================================
;; Implicit type application
;; ========================================

;; When calling a forall-quantified function:
xf1 rf          ;; compiler infers S from rf's type

;; Explicit when needed:
xf1 {Int} rf    ;; apply Int for S

;; ========================================
;; In spec, forall at argument position
;; ========================================

;; If you MUST write it inline:
spec foo (forall S. [S -> A -> S]) -> Result

;; Or with alias:
spec foo (Reducer _ A) -> Result   ;; _ = universally quantified
#+end_src

---

- Error Message Consideration

#+begin_src prologos
;; When user makes a mistake:

let bad = xf1 rf1 rf2

;; Error message should use vocabulary:

;; BAD:
"Expected: forall S. (S -> B -> S) -> (S -> A -> S)
 Got: (Int -> B -> Int)"

;; GOOD:
"Expected: Xf A B (a transducer from A to B)
 Got: a concrete reducer for Int

 A transducer must work for ANY state type S,
 but you provided a reducer that only works for Int.

 Hint: did you mean to wrap this in a transducer?
       map-xf f  instead of  (fn [rf] ...)"
#+end_src

---

- Final Syntax Proposal

#+begin_src prologos
;; ========================================
;; Defining higher-rank types (library author)
;; ========================================

;; Use 'type' with 'forall'
type Reducer S A = S -> A -> S
type Xf A B = forall S. Reducer S B -> Reducer S A

;; Or inline in spec
spec weird-fn
  (forall S. S -> S) -> Int   ;; function that works on any S

;; ========================================
;; Using higher-rank types (regular user)
;; ========================================

;; Just use the aliases
spec my-transform
  Xf String Int -> Xf Int Bool -> Xf String Bool

;; Implementation: compiler infers type applications
defn my-transform [xf1 xf2]
  fn [rf] [xf1 [xf2 rf]]

;; ========================================
;; Explicit type application when needed
;; ========================================

;; {Type} syntax for explicit application
defn explicit-example [xf]
  xf {Int} int-reducer    ;; apply Xf at S = Int

;; ========================================
;; Anonymous forall with _
;; ========================================

;; If you want quick inline:
spec quick
  (forall _. [_ -> A -> _] -> [_ -> B -> _]) -> C

;; _ is anonymous, equivalent to fresh variable
#+end_src

---

- Does This Feel More Approachable?

The strategy:
1. /Name the concepts/ with type aliases
2. /Hide the forall/ inside those aliases
3. /Users work with domain vocabulary/ (Xf, Reducer)
4. /Library authors use forall/ when defining aliases
5. /Explicit {S}/ only when compiler can't infer







