my_notes.org
* pipe






I'm confused at how `|>` and `>>` are being used in piping.prologos.



They should be *prefix* notation. We are aiming to be a homoiconic language with prefix notation, for consistent syntax, macro definition, and code-as-data introspectability.



Both of these operators should take a list of expressions 



Our piping implementation is fundamentally flawed in an important way, breaking a core invariant.

In our memory file, let us emphasis a core invariant of Prologos:
 * Prologos is a homoiconic language, supporting code-as-data
   * Simple, uniform syntax with prefix notation
   * Macros work on post-parse level (where whitespaces are resolved) to enable clear and predictable ASTs
   * macros as first-class metaprogramming
     - hygienic macros
     - user available
   * Excellent inspection tools
     - macroexpand
     - quote
     - clear, visible AST available

After we note this in our memory, let's do a full language design audit looking out for issues that may threaten this invariant. Let's identify gaps and opportunities to improve on this promise, and design and plan out tooling and infrastructure that will help us improve on this promise, and can be used for further development.


